const startpopup = document.getElementById('start-pop-up');
const startbutton = document.getElementById('start-btn');
const test = document.getElementById('test');

startbutton.addEventListener("click", () => {
    StartTest();
})

function StartTest(){
    startpopup.classList.add("hidden");
    test.classList.remove("hidden");

    const question = document.getElementById('question');
    const allQuestions = [
        "Какво гласи първият закон на Нютон (закон за инерцията)?",
        "Какво определя вторият закон на Нютон?",
        "Коя от следните величини е векторна?",
        "Какво се случва с едно тяло, ако върху него действа ненулева равнодействаща сила?",
        "Как се нарича съпротивлението, което тялото оказва на всяка промяна в скоростта си?",
        "Каква е формулата за силата според втория закон на Нютон?",
        "Кога един предмет е в равновесие?",
        "Третият закон на Нютон гласи, че:",
        "Ако върху две тела действат равни сили, но едното тяло има по-голяма маса, то:",
        "Какво е теглото на тялото?",
        "Какво се случва с едно тяло, когато силата на тежестта и подемната сила на течността са равни?",
        "Кое от изброените НЕ е следствие на първия закон на Нютон?",
        "Тяло с маса 5 kg се движи под действието на сила от 20 N. Намерете ускорението на тялото.",
        "Тяло с маса 2 kg се намира в покой на хоризонтална повърхност. Намерете силата на триене, ако коефициентът на триене е 0.1 и g = 10 m/s^2.",
        "Камък с маса 1 kg е хвърлен нагоре с начална скорост 10m/s. Намерете силата на тежестта, която действа върху камъка, и ускорението му по време на движението."
    ]

    const allAnswers = {
        q1: {
            "Тялото се движи равномерно, ако върху него не действат сили или действа равнодействаща сила, равна на нула.": 1,
            "Всяко действие има равно по големина и противоположно по посока противодействие.": 0,
            "Ускорението на тялото е пропорционално на действащата върху него сила.": 0,
        },
        q2: {
            "Скоростта на едно тяло зависи от неговата маса.": 0,
            "Ускорението на едно тяло е пропорционално на действащата върху него сила.": 1,
            "Силата е равна на произведението на масата по скоростта.": 0,
        },
        q3: {
            "Маса": 0,
            "Сила": 1,
            "Път": 0,
        }
    }
}